/* Message text of the alert shown when an error occured while writing a sheet. */
"writeErrorMessageText" = "There was an error writing to disk. Please proceed with caution.";

/* Informative text of the alert shown when an error occured while writing a sheet. The placeholder contains the localized error message generated by the system. */
"writeErrorInformativeText" = "From the system log: %@";


/* Title of an alert sheet asking for permanent deletion of trashed sheets or groups. */
"MessageTextDeleteItems" = "Are you sure you want to permanently erase the selected items?";

/* Informative text in an alert sheet asking for permanent deletion of trashed sheets or groups. */
"InformativeTextDeleteItems" = "Erasing items such as sheets and groups permanently deletes them. You cannot undo this action.";

/* Delete button used when permanently deleting items. */
"EraseItems" = "Erase Items";

/* Cancel button used when copying/moving/importing/merging items, deleting items or emptying trash. */
"Cancel" = "Cancel";


/* Title of error panel shown to the user when a sheet cannot be read from some reason. */
"UnableToOpenSheet" = "Unable to open sheet.";

/* Description text of error panel shown to the user when a sheet cannot be read fro some reason. First placeholder is filename, second placeholder will be replaced with a more detailled error description. */
"UnableToOpenSheetText" = "An error occurred while trying to read the sheet “%@”:\n\n%@";

/* Recovery button in panel showing error details for an unreadable sheet: Reveals the broeken document in finder. */
"RevealInFinder" = "Show in Finder";


/* Title of an alert sheet asking for permanently emptying the trash. */
"MessageTextEmptyTrash" = "Are you sure you want to permanently erase all items in the Trash?";

/* Informative text in the dialog asking for permanently emptying the trash. Informs that the action cannot be undone. */
"InformativeTextEmptyTrash" = "Erasing items such as sheets and groups permanently deletes them. You cannot undo this action.";

/* Button used for emptying the trash. */
"EmptyTrash" = "Empty Trash";


/* Title of an alert sheet explaining the user that copying/moving/importing certain sheets will result in a lossy result. Used to show a single definition name in the title (e.g. 'Images cannot be used in “External Folders“'). The placeholder will be replaced by the name of the lost definition (see pluralized_image). The last placeholder contains the name of the target source (e.g. ”External Folders” or Daedalus). */
"MessageTextLossyCopySingleDefinition" = "%@ cannot be used in “%@”";

/* Title of an alert sheet explaining the user that copying/moving/importing certain sheets will result in a lossy result. Used to show two or more definition names in the title (e.g. 'Images, Videos and Footnotes cannot be used in “External Folders“'). The first placeholder contains either the name of the lost definition (e.g. pluralized_image) or a list of definition names (see LostDefinitionNamesList). The second placeholder will contain the last definition that will be lost (e.g. pluralized_image). The last placeholder contains the name of the target source (e.g. ”External Folders” or Daedalus). */
"MessageTextLossyCopyMultipleDefinitions" = "%@ and %@ cannot be used in “%@”";

/* Used by LostDefinitionNamesMultiple, if more than two definitions should be mentioned (e.g. 'Images, Videos, Footnotes, Annotations'). The first placeholder may either contain a single definition (see pluralized_image) or multiple elements generated in turn by LostDefinitionNamesMultiple. The last placeholder will only contain a single definition name (e.g. pluralized_image). */
"LostDefinitionNamesList" = "%@, %@";


/* The pluralized name of the definition link. Will be used by LostDefinitionNamesSingle, LostDefinitionNamesMultiple and LostDefinitionNamesList. */
"pluralized_link" = "Links";

/* The pluralized name of the definition annotation. Will be used by LostDefinitionNamesSingle, LostDefinitionNamesMultiple and LostDefinitionNamesList. */
"pluralized_annotation" = "Annotations";

/* The pluralized name of the definition footnote. Will be used by LostDefinitionNamesSingle, LostDefinitionNamesMultiple and LostDefinitionNamesList. */
"pluralized_footnote" = "Footnotes";

/* The pluralized name of the definition image. Will be used by LostDefinitionNamesSingle, LostDefinitionNamesMultiple and LostDefinitionNamesList. */
"pluralized_image" = "Images";

/* The pluralized name of the definition video. Will be used by LostDefinitionNamesSingle, LostDefinitionNamesMultiple and LostDefinitionNamesList. */
"pluralized_video" = "Videos";

/* The pluralized name of keywords attached to a sheet. Will be used by LostDefinitionNamesSingle, LostDefinitionNamesMultiple and LostDefinitionNamesList. */
"pluralized_attachment_keywords" = "Keywords";

/* The pluralized name of notes attached to a sheet. Will be used by LostDefinitionNamesSingle, LostDefinitionNamesMultiple and LostDefinitionNamesList. */
"pluralized_attachment_note" = "Notes";

/* The pluralized name of images attached to a sheet. Will be used by LostDefinitionNamesSingle, LostDefinitionNamesMultiple and LostDefinitionNamesList. */
"pluralized_attachment_image" = "Image Attachments";

/* The pluralized name of counting goals attached to a sheet. Will be used by LostDefinitionNamesSingle, LostDefinitionNamesMultiple and LostDefinitionNamesList. */
"pluralized_attachment_goal" = "Goals";




/* Informative text of an alert sheet explaining the user that copying certain sheets will result in a lossy copy. The first placeholder contains the name of the target group of the operation. The second placeholder will contain a descriptive list of all items that are actually lost. If a single item cannot be converted, LossDescriptionSingle is used. If multiple cannot be converted, LossDescriptionMultiple is used. (e.g. "Some of the sheets you are copying to “Daedalus“ use features that are not available in this section. If proceding, images will be lost, videos will be lost and footnotes will be lost").  */
"InformativeTextLossyCopy" = "Some of the sheets you are copying to “%@” use features that are not available in this section.\n%@";

/* Informative text of an alert sheet explaining the user that moving certain sheets will result in a data loss. The first placeholder contains the name of the target group of the operation. The second placeholder will contain a descriptive list of all items that are actually lost. If a single item cannot be converted, LossDescriptionSingle is used. If multiple cannot be converted, LossDescriptionMultiple is used. (e.g. "Some of the sheets you are moving to “Daedalus“ use features that are not available in this section. If proceding, images will be lost, videos will be lost and footnotes will be lost").  */
"InformativeTextLossyMove" = "Some of the sheets you are moving to “%@” use features that are not available in this section.\n%@";

/* Informative text of an alert sheet explaining the user that importing certain sheets will result in a data loss. The first placeholder contains the name of the target group of the operation. The second placeholder will contain a descriptive list of all items that are actually lost. If a single item cannot be converted, LossDescriptionSingle is used. If multiple cannot be converted, LossDescriptionMultiple is used. (e.g. "Some of the sheets you are importing to “Daedalus“ use features that are not available in this section. If proceding, images will be lost, videos will be lost and footnotes will be lost").  */
"InformativeTextLossyImport" = "Some of the sheets you are importing to “%@” use features that are not available in this section.\n%@";


/* Button for accepting a lossy copy/move/import/merge of an item in the dialog asking for making a lossy copy/move/import/merge of a sheet. */
"ConfirmLoss" = "Proceed";




/* Title of a second alert sheet asking the user to confirm, whether sheets should be really moved even though content may be lost. The user has the alternative to copy the sheets. */
"MessageTextLossyMoveConfirmation" = "Are you sure you want to proceed? This action can not be undone.";

/* Informative text in the dialog asking the user to confirm a move operation. The placeholder contains a description of the information that will be lost (see LossDescriptionSingle and LossDescriptionMultiple). */
"InformativeTextLossyMoveConfirmation" = "%@";

/* Button for accepting a lossy move of an item in the dialog asking for confirming a lossy move of a sheet. */
"ConfirmMove" = "Move";

/* Button for falling back to a lossy copy of an item in the dialog asking for confirming a lossy move of a sheet. */
"ConfirmCopy" = "Copy";



/* Title of alert sheet asking the user to confirm whether sheets should be merged. This title is shown when the merge operation is non-lossy (i.e. does not lose any data). */
"MessageTextNonLossyMerge" = "Are you sure you want to merge the selected sheets?";

/* Informative text of alert sheet explaining that when merging sheets, the original sheets will be moved to the trash. This text is shown when the merge operation is non-lossy (i.e. does not lose any data). */
"InformativeTextNonLossyMerge" = "The original sheets will be moved to the Trash. You cannot undo this action.";

/* Title of alert sheet asking the user to confirm that merging the sheets will result in a data loss. Used to show a single definition name in the title (e.g. 'Keywords cannot be preserved during merge'). The placeholder will be replaced by the name of the lost definition (see pluralized_attachment_keywords). */
"MessageTextLossyMerge" = "%@ cannot be preserved during merge";

/* Title of alert sheet asking the user to confirm that merging the sheets will result in a data loss. Used to show two or more definition names in the title (e.g. 'Keywords, Images and Footnotes cannot be preserved during merge'). The first placeholder contains either the name of the lost definition (e.g. pluralized_attachment_keywords) or a list of definition names (see LostDefinitionNamesList). The second placeholder will contain the last definition that will be lost (e.g. pluralized_attachment_keywords). */
"MessageTextLossyMergeMultipleDefinitions" = "%@ and %@ cannot be preserved during merge";

/* Title of the suppression button shown when asking the user when running a non-lossy sheet merge operation. If selected, the user will not be asked again during non-lossy merge operations. */
"DoNotAskAgain" = "Do not ask again";

/* Button for accepting a merge operation of sheets. */
"ConfirmMerge" = "Merge";



/* Used by InformativeTextLossyCopy, InformativeTextLossyMove, InformativeTextLossyImport, InformativeTextLossyMoveConfirmation. Used also as informative text when lossy-merging sheets. Will be used if only a single type of definition will be lost (e.g. "If you proceed, images will be lost."). The placeholder contains a snippet describing the lost content (see conversionError_image). */
"LossDescriptionSingle" = "If you proceed, %@.";

/* Used by InformativeTextLossyCopy, InformativeTextLossyMove, InformativeTextLossyImport, InformativeTextLossyMoveConfirmation. Used also as informative text when lossy-merging sheets. Will be used if at least two different types of definitions will be lost (e.g. "If you proceed, images will be lost and footnotes will be lost."). The first placeholder contains either a single descriptions of the lost content (see conversionError_image) or a list of multiple descriptions (see LossDescriptionList). The second placeholder will contain the last descriptions. */
"LossDescriptionMultiple" = "If you proceed, %@ and %@.";

/* Used by LossDescriptionMultiple to create a list of descriptions for definitions lost during copy, move, import or merge operation. The first placeholder may either contain a single description (see conversionError_image) or multiple elements generated in turn by LossDescriptionList. The last placeholder will only contain a single description. */
"LossDescriptionList" = "%@, %@";


/* A snippet embedded to LossDescriptionSingle, LossDescriptionMultiple or LossDescriptionList. Will be used if a link cannot be converted when copying/moving/importing a document. */
"conversionError_link" = "links will be lost";

/* A snippet embedded to LossDescriptionSingle, LossDescriptionMultiple or LossDescriptionList. Will be used if an annoation cannot be converted when copying/moving/importing a document. */
"conversionError_annotation" = "annotations will be lost";

/* A snippet embedded to LossDescriptionSingle, LossDescriptionMultiple or LossDescriptionList. Will be used if a footnote cannot be converted when copying/moving/importing a document. */
"conversionError_footnote" = "footnotes will be lost";

/* A snippet embedded to LossDescriptionSingle, LossDescriptionMultiple or LossDescriptionList. Will be used if an image cannot be converted when copying/moving/importing a document. */
"conversionError_image" = "images will be lost";

/* A snippet embedded to LossDescriptionSingle, LossDescriptionMultiple or LossDescriptionList. Will be used if a video cannot be converted when copying/moving/importing a document. */
"conversionError_video" = "videos will be lost";

/* A snippet embedded to LossDescriptionSingle, LossDescriptionMultiple or LossDescriptionList. Will be used if keywords attached to a sheet cannot be converted when copying/moving/importing a document. */
"conversionError_attachment_keywords" = "keywords will be lost";

/* A snippet embedded to LossDescriptionSingle, LossDescriptionMultiple or LossDescriptionList. Will be used if notes attached to a sheet cannot be converted when copying/moving/importing a document. */
"conversionError_attachment_note" = "notes will be lost";

/* A snippet embedded to LossDescriptionSingle, LossDescriptionMultiple or LossDescriptionList. Will be used if images attached to a sheet cannot be converted when copying/moving/importing a document. */
"conversionError_attachment_image" = "image attachments will be lost";

/* A snippet embedded to LossDescriptionSingle, LossDescriptionMultiple or LossDescriptionList. Will be used if counting goals attached to a sheet cannot be converted when copying/moving/importing a document. */
"conversionError_attachment_goal" = "goals will be lost";
